#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_subnet.private_app_1 must be replaced
-/+ resource "aws_subnet" "private_app_1" {
      ~ arn                             = "arn:aws:ec2:us-east-2:515410595219:subnet/subnet-0cca6a9bc61c1abd5" -> (known after apply)
        assign_ipv6_address_on_creation = false
        availability_zone               = "us-east-2a"
      ~ availability_zone_id            = "use2-az1" -> (known after apply)
      ~ cidr_block                      = "10.20.0.0/24" -> "10.20.2.0/24" # forces replacement
      ~ id                              = "subnet-0cca6a9bc61c1abd5" -> (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
        map_public_ip_on_launch         = false
      ~ owner_id                        = "515410595219" -> (known after apply)
        tags                            = {
            "Name"       = "Private Subnet"
            "Visibility" = "Private"
        }
        vpc_id                          = "vpc-0ab024cb70d2df06b"
    }

Plan: 1 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Workflow: `Plan`, Action: `hashicorpterraform-github-actions4`*